Revit 2027 API
ProjectInfo.BuildingName Property
Get or Set the Building Name of the Project Information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string BuildingName { get; set; }
Public Property BuildingName As String
	Get
	Set
public:
property String^ BuildingName {
	String^ get ();
	void set (String^ value);
}
member BuildingName : string with get, set
Property Value
String
Remarks
This property is used to get or set the Project Number of the Project Information.
See Also
Reference
ProjectInfo Class
Autodesk.Revit.DB Namespace